[{"title": "‘AC Valhalla’ patch brings a performance mode toggle to PS5 and Xbox Series X/S", "link": "https://www.engadget.com/assassins-creed-valhalla-update-104-225303010.html", "description": "'Valhalla' players can drop the game down to 30 FPS in 'quality' mode for better visuals.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>Just in time for Thanksgiving in the US, Ubisoft is releasing the next major patch for <a href=\"https://www.engadget.com/assassins-creed-valhalla-ubisoft-forward-demo-preview-195635696.html\"><em>Assassin’s Creed Valhalla</em></a>. Tomorrow you’ll be able to download the game’s <a href=\"https://discussions.ubisoft.com/topic/84566/assassin-s-creed-valhalla-title-update-1-0-4?lang=en-US\" target=\"_blank\">1.04 update</a>. It comes with a host of improvements, but the most notable addition is a new setting that allows you to choose between performance and quality presets on the <a href=\"https://www.engadget.com/sony-playstation-5-review-130048353.html\">PlayStation 5</a>, <a href=\"https://www.engadget.com/xbox-series-x-review-microsoft-140045437.html\">Xbox Series X</a> and <a href=\"https://www.engadget.com/xbox-series-s-review-140027758.html\">Series S</a>. </p><p>When you pick the performance setting, your new console will try to consistently render the game at 60 frames per second while dynamically adjusting the resolution and other graphical settings. In quality mode, meanwhile, the game will prioritize fidelity while aiming for a 30 frames per second target. </p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<figure class=\"iframe-container\"><iframe allowfullscreen=\"false\" frameborder=\"0\" height=\"720\" scrolling=\"no\" src=\"https://www.youtube.com/embed/rzaSrS1fsvc\" width=\"1280\"></iframe></figure><p>Worth noting here is that the game had performance and quality presets already, but you couldn’t set them yourself. Instead, each console stuck with a default performance target. For the PS5 and Xbox Series X, that meant 60 frames per second, while the Xbox Series S stuck to a more modest 30 frames per second. Ubisoft says the update also tweaks the Series X and Series S versions of the game to improve overall performance, including the screen tearing that’s been an issue on those consoles. </p><p>If you’ve had a chance to play <em>Assassin’s Creed Valhalla</em>, you’ll know it’s a buggy game in its current state. Thankfully, tomorrow’s update also comes with a long list of bug fixes. There are too many to go over all of them, but a couple stand out for addressing some of the more unusual and humorous glitches that slipped through the Q&amp;A process. Once you install the update, you won’t have to worry about dogs levitating when your character pets them, and crows will no longer randomly fall from the sky when you visit Asgard. Oh, and fish in Norway will now spawn in bad weather. Good stuff. </p><p>The update will start rolling out at approximately 7 AM ET. Depending on the console, you can expect a download between 2.5GB and 5.3GB. </p>\n</div>"]}, {"title": "An enhanced version of 'Metro Exodus' is coming to PS5 and Xbox Series X/S", "link": "https://www.engadget.com/metro-exodus-ps5-xbox-series-x-series-s-enhanced-ray-tracing-173138061.html", "description": "The next Metro game, which is in the works, could have a multiplayer component.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>An enhanced version of <a href=\"https://www.engadget.com/2018-06-12-metro-exodus-e3-2018.html\"><em>Metro Exodus</em></a> is on the way to <a href=\"https://www.engadget.com/sony-gaming-chief-says-the-ps-5-would-be-sold-out-even-without-covid-19-124538616.html\">PlayStation 5</a> and <a href=\"https://www.engadget.com/microsoft-xbox-series-x-shortages-until-april-154757026.html\">Xbox Series X/S</a>, developer 4A Games and publisher Deep Silver have confirmed. Those who own the first-person shooter on PS4 or Xbox One will get a free upgrade on the respective platform. A release date for the enhanced edition, which will <a href=\"http://www.4a-games.com.mt/4a-dna/2020/11/17/metro-10th-anniversary-studio-update\" target=\"_blank\">arrive next year</a>, will be announced soon.</p><p>There aren't too many surprises about what the PS5 and Xbox Series X/S version of the game will offer. It’ll include improved frame rates, faster loading times, upgraded resolution and ray-traced visuals. Linux and Mac versions of <em>Metro Exodus </em>are also on the way — the game recently arrived on <a href=\"https://www.engadget.com/amazon-luna-early-access-174007652.html\">Amazon's Luna platform</a> too.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<figure class=\"iframe-container\"><iframe allowfullscreen=\"false\" frameborder=\"0\" height=\"720\" scrolling=\"no\" src=\"https://www.youtube.com/embed/oBu9j9biRu0\" width=\"1280\"></iframe></figure><p>Meanwhile, 4A Games <a href=\"https://www.metrothegame.com/news/the-future-of-metro-4a-games-reveal-their-plans-for-the-series/\" target=\"_blank\">says</a> the next entry in the <a href=\"https://www.engadget.com/2020-01-16-metro-redux-nintendo-switch-4a-games.html\">Metro franchise</a> is in development for PS5, Xbox Series X/S and PC. The developer is overhauling the game engine and renderer \"to take advantage of the new power, storage and hardware-supported ray-tracing afforded by the new consoles.\" </p><p>While the studio plans to focus on a single-player experience for the upcoming game, it's \"actively exploring multiplayer concepts\" for the Metro universe along with its partner Saber Interactive. It's unclear for now exactly what that will entail — 4A says it's \"still figuring things out.\" However, it seems likely there'll be a multiplayer Metro game or mode at some point.</p>\n</div>"]}, {"title": "'Rainbow Six Siege' has a 4K 120 fps mode on PS5 and Xbox Series X", "link": "https://www.engadget.com/rainbow-six-siege-next-gen-update-195201108.html", "description": "You'll get a free upgrade to those versions on December 1st.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>Like a lot of other popular Xbox One and PS4-era games, <a href=\"https://www.engadget.com/2020-02-17-rainbow-six-siege-next-gen-consoles-at-launch.html\"><em>Rainbow Six Siege</em></a> is about to get a next-gen update. Ubisoft <a href=\"https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/4qcvHDulgxm5CC565Bo042/tom-clancys-rainbow-six-siege-nextgeneration-consoles\" target=\"_blank\">detailed</a> what players can expect from the upgrade when it comes out on December 1st. Across all three consoles, you’ll have the choice of playing the game in either a performance or resolution mode.</p><p>On <a href=\"https://www.engadget.com/xbox-series-x-review-microsoft-140045437.html\">Xbox Series X</a> and <a href=\"https://www.engadget.com/sony-playstation-5-review-130048353.html\">PS5</a>, performance mode will target 120 frames per second at a dynamic 4K resolution — which means the resolution will scale down in some instances so the game can keep a steady framerate. The less powerful <a href=\"https://www.engadget.com/xbox-series-s-review-140027758.html\">Xbox Series S</a> will target 120 frames per second at 1080p.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<p>Resolution mode, meanwhile, will see the PS5 and Xbox Series X target 60 fps while maintaining a 4K resolution, while the Series S will downsample the game from 1728p. With a competitive game like <em>Rainbow Six Siege</em>, you have to imagine most people will go for the performance mode and never look back. Still, it’s nice of Ubisoft to offer the option to play the game at a higher fidelity, particularly for those who don’t have 120Hz TVs. </p><p>As for console-specific enhancements, you can expect all the usual improvements. On Xbox Series X/S, <em>Rainbow Six Siege</em> will take advantage of Microsoft’s Quick Resume functionality, allowing you to switch between the game and other supported titles nearly instantaneously. On PS5, meanwhile, the game will take advantage of all the haptic enhancements built into its <a href=\"https://www.engadget.com/playstation-5-dual-sense-controller-haptics-adaptive-trigger-143808158.html\">DualSense controller</a>. For example, the trigger will be easier to pull when you’re using a lighter weapon like a pistol. Lastly, they’ll be support for cross-gen play between the same family of consoles so you can continue to play with your friends as they sort out their console upgrades.</p><p>The update is free if you’re upgrading to the next-gen version of your current console. So if you own the game on PS4, you won’t have to buy it again on PS5. What’s more, your progression and in-game items will carry over. The one caveat here is that if you own the game on a disc, you’ll need a console with a disc drive to get a free upgrade. </p>\n</div>"]}, {"title": "PS5 gamepad triggers will tighten as 'FIFA 21' players get fatigued", "link": "https://www.engadget.com/fifa-21-ps5-dualsense-enhancements-153404792.html", "description": "You can also start matches much faster than before.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>EA is finally ready to explain just how <a href=\"https://www.engadget.com/fifa-21-release-date-ps4-xbox-one-ps5-xbox-series-x-pc-005130565.html\"><em>FIFA 21</em></a> will improve on the <a href=\"https://www.engadget.com/sony-playstation-5-review-130048353.html\">PlayStation 5</a> with its December 4th update. While you can expect the usual round of visual upgrades (more on those later), the true highlight may be <em>FIFA</em>’s use of the DualSense controller to aid gameplay. For one, the adaptive triggers will add resistance as your players’ stamina worsens — you may quickly realize it’s time for a substitution. This isn’t completely novel (<a href=\"https://www.engadget.com/nba-2k21-next-gen-trailer-032118003.html\"><em>NBA 2K21</em></a> also does it), but it’ll be appreciated in the heat of the action. You’ll also get haptic feedback that reflects the foot a player used for a kick, and tackles should be more forceful than the usual fights for position during corner kicks.</p><p>It should be faster to hop into a match. EA is taking advantage of the PS5’s <a href=\"https://www.engadget.com/ps5-user-interface-133838685.html\">Activity Cards</a> to jump directly into certain modes right from the console’s home screen. If all you want is a quick friendly match, you can start it in seconds.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<p>And yes, there are plenty of visual enhancements. You’ll see more responsive “multi-touch” animations that promise better ball control, not to mention more convincing hair and muscles. Deferred lighting creates a more realistic stadium atmosphere. EA is even using next-gen hardware to play with camera angles, including a broadcast-like GameCam during play, pre-match cinematics to set scene and new reaction cameras for goals.</p><p>The PS5 update is free to owners of <em>FIFA 21</em> between December 4th and the eventual release of <em>FIFA 22</em>. You can expect many of the more generic improvements to cross over to the <a href=\"https://www.engadget.com/xbox-series-x-review-microsoft-140045437.html\">Xbox Series X</a>/S version arriving at the same time. However, it’s evident that EA isn’t just releasing a generic next-gen ugprade. It intends to take advantage of a given system when possible, even if the changes aren’t always visible on screen.</p><figure class=\"iframe-container\"><iframe allowfullscreen=\"false\" frameborder=\"0\" height=\"720\" scrolling=\"no\" src=\"https://www.youtube.com/embed/m8CBAjDjfwc\" width=\"1280\"></iframe></figure>\n</div>"]}, {"title": "Sony says the PS5 would still be sold out without a pandemic", "link": "https://www.engadget.com/sony-gaming-chief-says-the-ps-5-would-be-sold-out-even-without-covid-19-124538616.html", "description": "SIE CEO also said there's \"news to come\" in response to Microsoft's Game Pass.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>Sony Interactive Entertainment (SIE) CEO Jim Ryan confirmed that the <a href=\"https://www.engadget.com/sony-playstation-5-review-130048353.html\">PlayStation 5</a> is completely sold out despite his best efforts to have enough stock, according to an interview with the Russia’s <a href=\"https://tass.com/economy/1225233\" target=\"_blank\"><em>Tass</em></a>. He added that he believes the supply shortage would have happened even without COVID-19. However. despite the success of the console, launching in the middle of a pandemic was a challenge he “wouldn’t recommend” to anybody else.</p><p>“Everything is sold. Absolutely everything is sold,” he said. “I’ve spent much of the last year trying to be sure that we can generate enough demand for the product. And now... I’m spending a lot more time on trying to increase supply to meet that demand.”</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<p>The biggest issue caused by the pandemic was in pre-production, according to Ryan. Because of travel and other restrictions, “we had to do all the manufacturing preparation by camera remotely,” he said. “I mean, just imagine that for a precision device like the PlayStation 5.”</p><p>Ryan expressed relief at the success of the console during a difficult year, but said in the end that the product and sales would have likely been the same even if people weren’t stuck at home. “The way we took it to market might have been a bit different, but the actual product would have been the same,” Ryan said. “We might have had a few more to sell, but not very many; the guys on the production/manufacturing side have worked miracles.”</p><p>He said that Sony is taking a wait-and-see attitude over Microsoft’s <a href=\"https://www.engadget.com/microsoft-buys-zenimax-bethesda-id-arkane-131006192.html\">purchase</a> of Zenimax, including studios like Bethesda and id software. However, it sounds like the company plans to take some action in response to Microsoft’s Game Pass. “There is actually some news to come, but just not today,” he told <em>Tass</em>.</p>\n</div>"]}, {"title": "How ‘Astro’s Playroom’ captures the magic of PS5's DualSense controller", "link": "https://www.engadget.com/astros-playroom-nicolas-doucet-team-asobi-interview-143025371.html", "description": "Team Asobi's creative director on developing for a new type of gamepad.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>Sure, <em>Spider-Man: Miles Morales</em> and the <em>Dark Souls</em> remake are getting most of the PlayStation 5 love, but Sony’s most significant next-generation launch game may be <em>Astro’s Playroom</em>. It’s a showpiece for the new DualSense controller's haptic capabilities, which includes finely tuned rumbling and adaptive triggers with adjustable tension. Best of all, you can start playing it on your PS5 right away; it’s pre-installed on every system. Just like with <em>Astro Bot Rescue Mission</em> on the PlayStation VR, the diminutive robot is the ideal guide as Sony breaks new ground with hardware.</p><figure class=\"iframe-container\"><iframe allowfullscreen=\"false\" frameborder=\"0\" height=\"720\" scrolling=\"no\" src=\"https://www.youtube.com/embed/lu5VXrEqgco\" width=\"1280\"></iframe></figure><p> As I mentioned in my PlayStation 5 review, simply booting up the game jolted me awake -- it vibrated in my hands as if it was the one holding me. I could feel Astro’s every step, and I was even more amazed that every surface he walked on felt different. Thanks to the adaptive triggers, using a bow felt startlingly realistic, as if I was pulling back on a taut string.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<p>From the start, it’s easy to see that <em>Astro’s Playroom</em> was built in concert with the DualSense controller. In an interview with Engadget, Nicolas Doucet, creative director of Astro developer Team Asobi, said his group jumped at the chance to develop new ideas for the gamepad.</p><p><strong>[Check out our full interview with Nicolas Doucet on the Engadget Podcast below. Subscribe </strong><a href=\"https://go.skimresources.com/?id=72705X1521812&amp;isjs=1&amp;jv=14.4.0-stackpath&amp;sref=https%3A%2F%2Fwww.engadget.com%2Fengadget-podcast-macbook-air-m1-133054462.html&amp;url=https%3A%2F%2Fitunes.apple.com%2Fus%2Fpodcast%2Fthe-engadget-podcast%2Fid1142790530%3Fmt%3D2&amp;xguid=36690a86fca56c48f840d25a347a2d75&amp;xs=1&amp;xtz=300&amp;xuuid=ddead85ab3e11a1153fe2081ee6b6c46&amp;xjsf=other_click__contextmenu%20%5B0%5D\"><strong>on iTunes</strong></a><strong> and </strong><a href=\"https://open.spotify.com/show/3EC3dMIRB99dkvoSBeSO7G?si=f7UALGKmRDWtOrU8Z4-uiQ\" target=\"_blank\"><strong>Spotify</strong></a><strong>!]</strong></p><div> <iframe allow=\"autoplay\" frameborder=\"no\" height=\"300\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/934835761&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&amp;visual=true\" width=\"100%\"> </iframe> <div style=\"font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;\"> <a href=\"https://soundcloud.com/engadget-podcast\" style=\"color: #cccccc; text-decoration: none;\" target=\"_blank\" title=\"Engadget\">Engadget</a> ·   <a href=\"https://soundcloud.com/engadget-podcast/interview-special-astros-playroom-director-nicolas-doucet\" style=\"color: #cccccc; text-decoration: none;\" target=\"_blank\" title=\"Interview: Astro's Playroom director on making a PS5 showpiece\">Interview: Astro's Playroom director on making a PS5 showpiece</a> </div> </div><p> “We’re based in Japan, and [Sony’s] hardware engineering is also in Japan, so we have this kind of old relationship of collaboration with the team,” he said. “Those guys come up with these mechanical features that go inside the controllers, and of course they have a good kind of hunch for what might be a good thing for the future of games. But their core discipline is mechanical engineering.\" </p><p>Thanks to their proximity, Team Asobi was able to snag early DualSense prototypes, which at the time were large and saddled with assorted wires. “At the time, the form factor isn't really the point,” Doucet said. “It’s more about having all of these features and whether they’re usable inside the game and making the experience better.” </p> </div>", "<div class=\"article-text c-gray-1\">\n<p>Doucet and team started rapidly prototyping gameplay concepts. The first was a small shooting range with pistols, shotguns and a variety of other weapons, which was meant to test how the adaptive triggers handled them. They also learned how the revamped haptics could make walking over a variety of surfaces feel distinct even on a handheld device, so you could tell the difference between sand, water and ice without looking at the screen. </p><p>One demo effectively simulated the feeling of controlling a character in a motorcycle, so much so that you could feel the engine revving up and the exhaust kicking back in the controller. That test even surprised Sony’s engineers. After Team Asobi shared some of their gameplay findings, the engineers ended up tweaking some aspects of the DualSense controller's design. </p><p>“It made them think about weight position in the controller, and does it work so you feel it well,” Doucet said.”  “Do you get that kind of trinity, of what you see, what you feel, and what you feel? Does it feel right? It helps us kind of get better.” </p> </div>", "<div class=\"article-text c-gray-1\">\n<p>Team Asobi only had three developers working on the DualSense gameplay prototypes for a few months, but they managed to come up with 80 tech demos. To put this timeframe in perspective, the group was also in the process of finishing their last game, <em>Astro Bot Rescue Mission</em>. As they started to think about what to do with their DualSense findings, Asobi decided not just to create a collection of minigames, something that’s been done plenty of times with new tech. (Take, for example, Valve’s \"The Lab” demos that debuted with SteamVR headset.) </p><p>Doucet says Team Asobi wanted to do a preinstalled title for the PS5 from the beginning; it wasn’t a mandate from Sony’s higher ups. And they realized they already had a great character in Astro. He's cute, easy to control and likely the best mascot Sony has had yet. (Sorry, Crash Bandicoot.) So Team Asobi decided to do something it’s never done before: build a complete non-VR game for Sony’s new console. </p><p>“It felt like, if we could absorb as many of these tech demos as possible, and make them inside a cohesive experience, it would probably have a lot more value and fun than having a collection of minigames,” Doucet said. “And then there’s the benefit of bringing our character to a wider audience.” </p><p>But Team Asobi wasn't the only developer previewing the DualSense hardware. As Doucet describes, the company also brought in PlayStation studios and third-party developers to try out the controller and throw ideas around. His team ended up getting some pointers from Naughty Dog's Santa Monica and others, which made their way into <em>Astro’s Playroom</em>. Team Asobi was able to share their early gameplay demos as well, which could end up influencing the first wave of PlayStation 5 titles. </p> </div>", "<div class=\"article-text c-gray-1\">\n<p>While you wouldn’t know it from playing Astro’s Playroom, it’s Team Asobi’s first non-VR title. And while Sony hasn’t said anything about a new PlayStation VR for the PS5, I couldn’t help but wonder if Doucet had some ideas in mind for using the DualSense controller in virtual reality. </p><p>“I would love if, two or three years from now, when we look back, we can say for sure that first implementation was really cool, really magical, but today we can do even better,” Doucet said. “I think that would also prove that this technology has got legs to evolve throughout the life cycle [of the PS5]. It's not one of those things that you do once and that’s it. I think we’re going to continue exploring and finding new things, and refining it in ways that maybe today we just haven’t thought of yet.”</p>\n</div>"]}, {"title": "Amazon UK is investigating reports of stolen PS5 orders", "link": "https://www.engadget.com/amazon-uk-stolen-sony-ps5-190455178.html", "description": "Some people have had their PS5 orders replaced with cat food and other products.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>Between supply shortages and a staggered release date, the <a href=\"https://www.engadget.com/sony-playstation-5-review-130048353.html\">PlayStation 5</a> has been almost impossible to buy. So you imagine what it must feel like if you were able to pre-order one, wait patiently for release day and then never see the console show up. That’s what some people in the UK have had to put up with over the last day. </p><p>As <a href=\"https://www.eurogamer.net/articles/2020-11-20-amazon-playstation-5-customers-report-receiving-toys-kitchen-appliances-instead\" target=\"_blank\"><em>Eurogamer</em></a> points out, since the console came out across the pond on <a href=\"https://www.engadget.com/sony-playstation-5-uk-europe-release-date-price-211534211.html\">November 19th</a>, there have been numerous reports on Twitter and Reddit of Amazon UK delivery people switching the contents of a PS5 delivery for something else. No one has gotten a <a href=\"https://www.gamespot.com/articles/walmart-shopper-buys-ps4-gets-box-full-of-rocks-in/1100-6424410/\" target=\"_blank\">box full of stones</a> (yet), but the substitutions have been varied: <a href=\"https://twitter.com/flagwithoutwind/status/1329553605892988929?s=20\" target=\"_blank\">pet food</a>, a <a href=\"https://twitter.com/hilly_cfc/status/1329553787309142016?s=20\" target=\"_blank\">foot massager</a> and a <a href=\"https://twitter.com/iamadamsullivan/status/1329546292545130496?s=20\" target=\"_blank\">bag of bulgur</a>. And while the contents of the packages have been different, the stories mostly all play out in the same way. The package gets delayed, and when it does finally show up, its sealed with clear tape instead of Amazon’s trademark Prime-branding.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<span> <blockquote class=\"twitter-tweet\"><p>So, <a href=\"https://twitter.com/AmazonUK?ref_src=twsrc%5Etfw\" target=\"_blank\">@AmazonUK</a> looks like someone has stolen my (day late) PS5. Right outer box, wrong item. Where can I get help? <a href=\"https://twitter.com/AmazonHelp?ref_src=twsrc%5Etfw\" target=\"_blank\">@AmazonHelp</a> <a href=\"https://twitter.com/PlayStationUK?ref_src=twsrc%5Etfw\" target=\"_blank\">@PlayStationUK</a> <a href=\"https://t.co/qBIZ3RHl1I\" target=\"_blank\">pic.twitter.com/qBIZ3RHl1I</a></p>— Anthony Dickens (@antdickens) <a href=\"https://twitter.com/antdickens/status/1329745842618699776?ref_src=twsrc%5Etfw\" target=\"_blank\">November 20, 2020</a></blockquote> </span><p>After a slow response, a spokesperson for Amazon told <em>Eurogamer </em>the company wants to do right by customers. \"We're all about making our customers happy, and that hasn't happened for a small proportion of these orders. We're really sorry about that and are investigating exactly what's happened,\" the spokesperson said. “We're reaching out to every customer who's had a problem and made us aware so we can put it right. Anyone who has had an issue with any order can contact our customer services team for help.\"</p><p>According to some of the affected people <em>Eurogamer </em>spoke to, Amazon has asked them to wait 48 hours to see if their deliveries show up. The company has also reportedly offered some gift vouchers as an apology for what’s happened.</p>\n</div>"]}, {"title": "Walmart plans to sell more PS5 and Xbox Series X consoles on Thursday", "link": "https://www.engadget.com/where-to-buy-ps5-xbox-series-x-walmart-035021312.html", "description": "The new Xbox and PlayStation consoles go on sale at 3PM ET on Walmart.com.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>As Microsoft and Sony have explained, supply of the next-gen gaming consoles is expected to be tight for the next several months at least. Those trying to track down a <a href=\"https://www.engadget.com/sony-playstation-5-review-130048353.html\">PlayStation 5</a> or <a href=\"https://www.engadget.com/xbox-series-x-review-microsoft-140045437.html\">Xbox Series X</a> have faced long odds, with stock somewhat randomly popping up either directly from the manufacturers or via retailers.</p><p>If you want to <a href=\"https://www.engadget.com/playstation-5-where-to-buy-025541191.html\">buy a PS5</a> or <a href=\"https://www.engadget.com/xbox-series-x-s-where-to-buy-025024151.html\">Xbox Series X</a> without waiting for Black Friday or paying high prices from resellers, set a reminder for 3 PM ET tomorrow, November 19th. Walmart said it will restock the PlayStation and Xbox consoles at that time, and the pages indicate you’ll also be able to snag the cheaper variants, like the PS5 Digital Edition or Xbox Series S as well.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<p><a class=\"athena-button\" href=\"https://goto.walmart.com/c/2055067/565706/9383?subId1=7&amp;subId2=buyersguide2020&amp;subId3=Orders-XboxX&amp;veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https%3A%2F%2Fwww.walmart.com%2Fip%2FXbox-Series-X%2F443574645\" target=\"_blank\">Buy Xbox Series X at Walmart - $499</a> <a class=\"athena-button\" href=\"https://goto.walmart.com/c/2055067/565706/9383?subId1=7&amp;subId2=buyersguide2020&amp;subId3=Orders-XboxS&amp;veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https%3A%2F%2Fwww.walmart.com%2Fip%2FXbox-Series-S%2F606518560\" target=\"_blank\">Buy Xbox Series S at Walmart - $299</a></p><p><a class=\"athena-button\" href=\"https://goto.walmart.com/c/2055067/565706/9383?subId1=7&amp;subId2=buyersguide2020&amp;subId3=Orders-PS5&amp;veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https%3A%2F%2Fwww.walmart.com%2Fip%2FPlayStation-5-Console%2F363472942\" target=\"_blank\">Buy PlayStation 5 at Walmart - $499</a> <a class=\"athena-button\" href=\"https://goto.walmart.com/c/2055067/565706/9383?subId1=7&amp;subId2=buyersguide2020&amp;subId3=Orders-PS5Digital&amp;veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https%3A%2F%2Fwww.walmart.com%2Fip%2FSony-PlayStation-5-Digital-Edition%2F493824815\" target=\"_blank\">Buy PlayStation 5 Digital at Walmart- $399</a></p><span> <blockquote class=\"twitter-tweet\"><p>‼️ Next Gen update ‼️ We’ll have more <a href=\"https://twitter.com/hashtag/PS5?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\">#PS5</a> &amp; <a href=\"https://twitter.com/hashtag/XboxSeriesX?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\">#XboxSeriesX</a> available ONLINE only on Thursday, Nov. 19 at 3 PM ET. 🎉</p>— Walmart (@Walmart) <a href=\"https://twitter.com/Walmart/status/1329161601782489088?ref_src=twsrc%5Etfw\" target=\"_blank\">November 18, 2020</a></blockquote> </span>\n</div>"]}, {"title": "The Audeze Penrose gaming headset for PS5 is available now", "link": "https://www.engadget.com/audeze-penrose-now-available-195310166.html", "description": "You can pre-order the Xbox version as well.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>After missing its original September release date, <a href=\"https://www.audeze.com/products/penrose-wireless-planar-magnetic-headset\" target=\"_blank\">Audeze’s $299 Penrose gaming headset</a> is now available to purchase. <a href=\"https://www.engadget.com/audeze-penrose-wireless-planar-magnetic-headset-gamers-130022805.html\">First announced in July</a>, it drew a lot of attention with its planar magnetic drivers. Like other headphones that feature the technology, the Penrose promises to deliver more natural sound with less distortion and a more immersive soundstage. </p><p>The Penrose comes in two flavors. The standard edition is compatible with the PS4 and PS5, as well as Windows and Mac PCs. The Penrose X, meanwhile, works with Xbox One and <a href=\"https://www.engadget.com/microsoft-xbox-series-x-shortages-until-april-154757026.html\">Xbox Series X/S consoles</a>, and Windows computers. The latter will start shipping to consumers in December.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<p>With Bluetooth 5.0 support, you can also use both headsets with your phone, allowing you to connect to Discord while still listening to audio from your console or computer. Additionally, both models come with a built-in microphone designed with help from Shure, a dongle for 2.4GHz connectivity and a battery that will get you about 15 hours of use on a single charge. </p><p>At $299, the Penrose is more expensive than your average gaming headset like the SteelSeries <a href=\"https://www.engadget.com/steelseries-arctis-9-130029318.html\">Arctis 9</a>, but relative to other planar headphones you’re getting a lot of value. The least you can expect to spend on a pair of planar headphones is $220 for a model like the <a href=\"https://drop.com/buy/drop-hifiman-he5xx\" target=\"_blank\">HiFiMan HE5XX</a> from Drop. It’s possible to turn that into the HE5XX into a gaming headset with a ModMic and an external soundcard like the Sennheiser GSX 300, but once you start factoring in the cost of all those components, you’re easily past the $299 the Penrose will set you back. You’ll also end up with a more complicated setup that’s tricky to get to work with consoles.</p>\n</div>"]}, {"title": "'Fortnite' now offers Houseparty video calls on PC, PS4 and PS5", "link": "https://www.engadget.com/houseparty-fortnite-video-chat-pc-ps4-ps5-announcement-110027836.html", "description": "You'll need to use your phone or tablet as the webcam.", "date_posted": "11.25.2020", "body": ["<div class=\"article-text c-gray-1\">\n<p>Houseparty wants to change the way that people communicate while playing video games. The company, which offers a social video calling service on macOS, iOS, Android and Chrome, is now integrating with <em>Fortnite</em>. That means you can chase down victories while chatting to your friends and, more importantly, seeing their faces on screen. You’ll need to have the Houseparty app installed on an iOS or Android device, though. (Your smartphone or tablet acts as the webcam, essentially.) Then, once you’ve linked your Houseparty and Epic Games accounts, you’ll be able to video chat while playing on a PC, PlayStation 4 or PlayStation 5 console.</p><p>What about other platforms, such as Xbox and Nintendo? For now, they’re incompatible. “We will let everyone know if we’re able to support more platforms in the future,” the <em>Fortnite</em> team said in a press release.</p>\n</div>", "<div class=\"article-text c-gray-1 no-review\">\n<figure class=\"iframe-container\"><iframe allowfullscreen=\"false\" frameborder=\"0\" height=\"720\" scrolling=\"no\" src=\"https://www.youtube.com/embed/yBMIlH8u-dE\" width=\"1280\"></iframe></figure><p>The integration is clearly meant for close friends and families — the groups you would normally organise in private parties or Discord servers — rather than superstar streamers. Houseparty has recognised the possible privacy implications, though. The company has emphasized that the Houseparty service is restricted to people over the age of 13. And only your Houseparty friends, as well as the friends of anyone in the room, will be able to join your call. You can also block people and, if you want to cap the number of participants, hit the lock button at any time. Finally, every webcam feed will be cropped around the player’s face and given a colorful background.</p>\n</div>"]}]